/* 
Латинский квадрат:
Латинским квадратом порядка n называется квадратная матрица размером n × n,
каждая строка и каждый столбец которой содержат все числа от 1 до n.
Напишите программу, которая проверяет, является ли заданная квадратная матрица латинским квадратом.
Формат входных данных:
На вход программе подаётся натуральное число n — количество строк и столбцов в матрице,
затем элементы матрицы: n строк, по n чисел в каждой, разделённые пробелами.
Формат выходных данных:
Программа должна вывести слово YES, если матрица является латинским квадратом, и слово NO, если не является.

*/


